---
kind: property
id: P:Autodesk.Revit.DB.Mechanical.DuctFittingAndAccessoryData.Origin
zh: 原点
source: html/e861b86d-b8ef-6978-3c78-1ff297e512ff.htm
---
# Autodesk.Revit.DB.Mechanical.DuctFittingAndAccessoryData.Origin Property

**中文**: 原点

The origin position of the duct fitting or duct accessory.

## Syntax (C#)
```csharp
public XYZ Origin { get; }
```